app/controllers/api/v1/shipments_controller.rb

	def index
		@shipments = Shipment.all
---
SELECT "shipments".* FROM "shipments"

	def show
		@shipment = Shipment.find(params[:id])
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT 1  [["id", 0]]

	def create
		tp = shipment_params
		postal_code = tp[:postal_code]
		location = geo = Geokit::Geocoders::GoogleGeocoder.geocode(postal_code)
		tp[:city] = location.city
		tp[:state] = location.state
		tp[:country] = location.country
		@shipment = Shipment.new(tp)
		respond_to do |format|
	      if @shipment.save
---
INSERT INTO "shipments" ("name", "postal_code", "length", "width", "height", "weight", "cylinder", "city", "state", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"