app/controllers/api/v1/variants_controller.rb

SELECT  "variants".* FROM "variants" WHERE "variants"."variant_id" = $1 LIMIT 1  [["variant_id", "19496400257"]]
INSERT INTO "variants" ("actual_price", "wood_type", "type_price", "variant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["actual_price", 800], ["wood_type", "Gold"], ["type_price", 100], ["variant_id", "19496400257"], ["created_at", "2016-05-24 10:04:37.314534"], ["updated_at", "2016-05-24 10:04:37.314534"]]
UPDATE "variants" SET "wood_type" = $1, "type_price" = $2, "updated_at" = $3 WHERE "variants"."id" = $4  [["wood_type", "Wood"], ["type_price", 30], ["updated_at", "2016-05-24 10:51:13.482934"], ["id", 4]]
---
	def create
		shop_url = "https://7d8179f9f2e1b8d8f0de77d4d334cb78:1230bebc99b982c5bf946ee111860e07@nick-90.myshopify.com/admin"
        ShopifyAPI::Base.site = shop_url
        shop = ShopifyAPI::Shop.current

		# Get a specific product
		# new_product = ShopifyAPI::Variant.find(19887283329)
  # 		new_product.option1 = "2ft"
  # 		new_product.option2 = "2ft"
  # 		new_product.option3 = "Silver"
  # 		new_product.save


		@variant_get = Variant.find_by_variant_id(variant_params[:variant_id])
		if @variant_get.nil?
			@variant = Variant.new(variant_params)
			respond_to do |format|
		      if @variant.save
		        format.json { render :json => @variant }
		      else
		        format.json { render :json => @variant.errors, status: :unprocessable_entity }
		      end
	    	end
		else
			respond_to do |format|
				if @variant_get.update_attributes(:wood_type => params[:variant][:wood_type], :type_price => params[:variant][:type_price])